# <h1 align="center"><font color="red">SQL Queries on Pandas DataFrames using Python</font></h1>

<font color="yellow">Data Scientist.: Dr. Eddy Giusepe Chirinos Isidro</font>

# <font color="gree">Exemplo 1:</font>

In [1]:
from pandasql import sqldf
import pandas as pd


# Criamos um DataFrame:
students= {
    'Students':["Sira", "Ibrahim", "Moussa", "Mamadou", "Nabintou"],
    'Gender':['Female', 'Male', 'Male', "Male", "Female"],
    'Age':[18, 27, 19, 22, 21],
    'Email': ["sira@info.com", "ib@info.com", "mouss@info.com", 
             "mam@info.com", "nab@info.com"]
          }
          
students_df = pd.DataFrame(students)

students_df

   Students  Gender  Age           Email
0      Sira  Female   18   sira@info.com
1   Ibrahim    Male   27     ib@info.com
2    Moussa    Male   19  mouss@info.com
3   Mamadou    Male   22    mam@info.com
4  Nabintou  Female   21    nab@info.com

In [2]:
# Criamos um DataFrame de Assistente de Ensino:
teaching_assistant= {
    'Teacher':["Ibrahim","Nabintou","Mamadou","Fatim","Aziz"],
    'Email':['ib@info.com','nab@info.com','mam@info.com', 
             "fat@info.com", "aziz@info.com"],
    'Degree':["M.S in Data Science", "B.S in Statistics", 
              "B. Comp Sc", "M.S. Architecture", "B.S in Accounting"],
    'Department': ["Business", "Statistics", "Comp Sc", 
             "Engineering", "Business"]
          }
teaching_assistant_df = pd.DataFrame(teaching_assistant)

teaching_assistant_df

    Teacher          Email               Degree   Department
0   Ibrahim    ib@info.com  M.S in Data Science     Business
1  Nabintou   nab@info.com    B.S in Statistics   Statistics
2   Mamadou   mam@info.com           B. Comp Sc      Comp Sc
3     Fatim   fat@info.com    M.S. Architecture  Engineering
4      Aziz  aziz@info.com    B.S in Accounting     Business

## <font color="pink">Seleção de dados</font>

In [3]:
# Podemos obter todos os dados das colunas da seguinte forma:
all_students = sqldf("SELECT * FROM students_df")
all_students

   Students  Gender  Age           Email
0      Sira  Female   18   sira@info.com
1   Ibrahim    Male   27     ib@info.com
2    Moussa    Male   19  mouss@info.com
3   Mamadou    Male   22    mam@info.com
4  Nabintou  Female   21    nab@info.com

In [4]:
print(type(all_students))
print("---"*10)
print(all_students.dtypes)

<class 'pandas.core.frame.DataFrame'>
------------------------------
Students    object
Gender      object
Age          int64
Email       object
dtype: object

In [10]:
# Selecione o nome do aluno e e-mail
query = """ SELECT Students, Email 
            FROM students_df 
            LIMIT 3
        """
name_email = sqldf(query)
name_email

  Students           Email
0     Sira   sira@info.com
1  Ibrahim     ib@info.com
2   Moussa  mouss@info.com

In [8]:
# Selecione o nome do aluno, e-mail e sexo:
query = """SELECT Students, Email, Gender
           FROM students_df
           LIMIT 2
        """
selection = sqldf(query)
selection

  Students          Email  Gender
0     Sira  sira@info.com  Female
1  Ibrahim    ib@info.com    Male

## <font color="pink">Filtragem de dados</font>

In [18]:
query = """SELECT * 
           FROM students_df 
           WHERE Gender = 'Female';
        """

female_student = sqldf(query)
female_student

   Students  Gender  Age          Email
0      Sira  Female   18  sira@info.com
1  Nabintou  Female   21   nab@info.com

In [17]:
# Selecione nome, sexo e e-mail de todos os alunos de mestrado:
query = """ SELECT Teacher, Email, Degree 
            FROM teaching_assistant_df 
            WHERE Degree LIKE 'M.S%';
        """
# 'M.S%': Esta é a expressão que define o padrão que estamos procurando. Caracteres Curinga --> `%`: Representa zero ou mais caracteres de qualquer tipo ou `_`: Representa um único caractere de qualquer tipo.
ms_students = sqldf(query)
ms_students

   Teacher         Email               Degree
0  Ibrahim   ib@info.com  M.S in Data Science
1    Fatim  fat@info.com    M.S. Architecture

<font color="orange">Com pandas seria, assim:</font>

In [13]:
cols_to_get = ['Teacher', 'Email', 'Degree']

teaching_assistant_df[teaching_assistant_df.Degree.str.startswith('M.S')][cols_to_get]

   Teacher         Email               Degree
0  Ibrahim   ib@info.com  M.S in Data Science
3    Fatim  fat@info.com    M.S. Architecture

## <font color="pink">Agregação de dados</font>

In [16]:
# Obtenha a idade média em termos de gênero:
query = """ SELECT AVG(Age), Gender 
            FROM students_df 
            GROUP BY Gender;
        """
avg_age = sqldf(query)
avg_age

    AVG(Age)  Gender
0  19.500000  Female
1  22.666667    Male

In [19]:
# Conte o número de ocorrências de cada departamento:
query = """ SELECT Department, COUNT(*) as Depart_Count
            FROM teaching_assistant_df 
            GROUP BY Department
            ORDER BY Depart_Count DESC;
        """

depart_count = sqldf(query)
depart_count

    Department  Depart_Count
0     Business             2
1   Statistics             1
2  Engineering             1
3      Comp Sc             1

## <font color="pink">Joins</font>

In [20]:
# Selecione alunos que são assistentes de professores (Teacher assistants) junto com seus departamentos:
query = """ SELECT st.Students, st.Gender, st.Email, st.Age, tat.Department
            FROM students_df st INNER JOIN teaching_assistant_df tat 
            ON st.Email = tat.Email;
            """

result = sqldf(query)
result

   Students  Gender         Email  Age  Department
0   Ibrahim    Male   ib@info.com   27    Business
1   Mamadou    Male  mam@info.com   22     Comp Sc
2  Nabintou  Female  nab@info.com   21  Statistics